app/views/donates/req.json.jbuilder


x = (@goal.quantity/User.all.count.to_f)/range.count
---
SELECT COUNT(*) FROM `users`

json.ideal range.map{|s|y += x}
json.atual range.map{|s|z += @donates.select{|d|d.created_at.to_date == s}.map{|s|s.product.quantity * s.quantity.to_f}.sum}
---
SELECT `products`.* FROM `products`