app/views/home/index.html.haml

SELECT `users`.* FROM `users` ORDER BY `users`.`email` ASC
---
              = f.label :user
              = f.select :user_id, options_for_select(User.order(email: :asc).all.map{|s|[s.email, s.id]}, selected: current_user.id), {}, class: 'form-control select2'