app/controllers/acts_controller.rb

SELECT `acts`.* FROM `acts`
---
  def index
    @acts = Act.all

SELECT `acts`.* FROM `acts`
SELECT  `goals`.* FROM `goals` ORDER BY `goals`.`id` ASC LIMIT 1
---
  def req
    @acts = Act.all
    @goals = Goal.all