app/controllers/donates_controller.rb

SELECT  `goals`.* FROM `goals` ORDER BY `goals`.`id` ASC LIMIT 1
SELECT `donates`.* FROM `donates` WHERE `donates`.`user_id` = 1
---
  def req
    @goal = Goal.first
    @donates = Donate.where(user: current_user)