app/controllers/goal_records_controller.rb

SELECT `goal_records`.* FROM `goal_records`
---
  def index
    @goal_records = GoalRecord.all