app/controllers/goals_controller.rb

SELECT `goals`.* FROM `goals`
---
  def index
    @goals = Goal.all

UPDATE `goals` SET `quantity` = 500, `kind` = 'kg', `end_at` = '2019-03-24 14:26:00', `updated_at` = '2019-03-08 14:27:01' WHERE `goals`.`id` = 1
---
  def update
    respond_to do |format|
      if @goal.update(goal_params)

SELECT  `goals`.* FROM `goals` WHERE `goals`.`id` = 1 LIMIT 1
---
    def set_goal
      @goal = Goal.find(params[:id])