app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
SELECT  `products`.* FROM `products` WHERE `products`.`code` = '' LIMIT 1
---
  def index
    @products = Product.all
    if params[:code]
      @products = Product.where(code: params[:code])

INSERT INTO `products` (`name`, `code`, `quantity`, `kind`, `photo_url`, `created_at`, `updated_at`) VALUES ('MACARRÃO TODESCHINI SPAGHETTI 05', '7896022205720', 1, 'Unidade', 'https://api.cosmos.bluesoft.com.br/assets/product-placeholder-ce4926921923d1e9bc66cd0e1493b49b.png', '2019-03-08 14:40:26', '2019-03-08 14:40:26')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

DELETE FROM `products` WHERE `products`.`id` = 3
---
  def destroy
    @product.destroy

SELECT `products`.* FROM `products`
---
  def req
    @products = Product.all

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
---
    def set_product
      @product = Product.find(params[:id])