app/views/products/req.json.jbuilder

json.labels @products.map{|s|s.name}
json.values @products.map{|s|s.donates.map{|c|c.quantity * s.quantity}.sum}
---
SELECT `donates`.* FROM `donates` WHERE `donates`.`product_id` = 3