app/views/acts/req.json.jbuilder

json.acts @acts.map{|s|s.goal_records.map{|s|s.quantity}}.flatten!
json.labels @acts.map{|s|s.goal_records.map{|s|s.name}}.flatten!
json.atual @acts.map{|s|s.donates.map{|s|s.product.quantity * s.quantity.to_f}.sum}
---
SELECT  `goals`.* FROM `goals` ORDER BY `goals`.`id` ASC LIMIT 1
SELECT `acts`.* FROM `acts`
SELECT `goal_records`.* FROM `goal_records` WHERE `goal_records`.`act_id` = 1
SELECT `donates`.* FROM `donates` WHERE `donates`.`act_id` = 1